TODO.org
#+OPTIONS: html-link-use-abs-url:nil html-postamble:t html-preamble:t
#+OPTIONS: html-scripts:t html-style:t html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+HTML_LINK_HOME: https://github.com/dieter-wilhelm/ansys-mode
#+HTML_LINK_UP: index.html
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+HTML_MATHJAX:
#+INFOJS_OPT:
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)
#+LATEX_HEADER:
#+title: The Todo file of ANSYS-Mode

#+STARTUP: showall
* Deficiencies:
  - Highlighting :: Experimental user variable highlighting
		    does not take into account:
    + clearing of variables and
    + usage of variables before their definitions (uninitialised
      variables)
    + the variable fontification might clash with ANSYS specifiers
    + string substitution of %variables% in strings does not highlight
       them in the proper variable face
  - Highlighting :: A label :LABEL may appear behind the /input
                    command and is not highlighted as label
  - Highlighting :: An apostrophy clashes with the ANSYS "char"
                    specifier Keybinding: M-Tab is captured under
                    Windows and some GNU-Linux desktops Workaround: Press
                    instead of M-Tab (ALT + TAB) the ESC key and then
                    the Tab key (ESC, TAB) or apply the command from
                    the menu bar
  - Highlighting :: The parameter help overlay is only removed after 2
                    min if the respective ANSYS-Mode buffer is the
                    current buffer at that time span!
  - Keybinding :: M-j: When there is already a `&' in a format command
                  (like *msg, *vwrite, *mwrite)
                  ansys-indent-format-line inserts a redundant one
  - Completion :: Of parametric function parentheses
		  completes redundant closing parentheses
  - Completion :: A mouse selection from the *ANSYS-completion* buffer
                  is only inserted upcased.
  - Completion :: ANSYS command 'C***' will not be completed
  - Skeleton :: Mouse selection of -structural-template does not work
                (because of stipulated user text input from this skeleton)
  - Navigation ::  C-c { does not skip an overlay in a number-block
                  (M-{ does it though))
* 16.1.2:
** Bugs
   - C-c C-j jjj not working with Emacs 23.1
   - Mouse completion is working with *middle* mouse button (mouse-2) but only
     on the second LMB or, in the case of C-c C-s, not at all.
   - *mwrite
     *cfclos
     M-? shows help for *mwrite, when cursor behind *cfclos and in the
     last line without \n
   - path construction in -mode.el for help program is not working, if
     ansys-mode is not activated!? <- autoloaded functions, should
     work they are calling -mode.el!
