TODO.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Todo file of ANSYS-Mode</title>
<!-- 2015-06-29 Mon 22:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="H. Dieter Wilhelm" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://github.com/dieter-wilhelm/ansys-mode"> HOME </a>
</div><div id="content">
<h1 class="title">The Todo file of ANSYS-Mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Deficiencies:</a></li>
<li><a href="#sec-2">2. 16.1.2:</a>
<ul>
<li><a href="#sec-2-1">2.1. Bugs</a></li>
<li><a href="#sec-2-2">2.2. Wish-list</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Procedures</a>
<ul>
<li><a href="#sec-3-1">3.1. Freeze proceedures</a></li>
<li><a href="#sec-3-2">3.2. Release</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Ideas for further versions</a>
<ul>
<li><a href="#sec-4-1">4.1. Parameter help and documentation</a></li>
<li><a href="#sec-4-2">4.2. ANSYS process and interpreter buffer</a></li>
<li><a href="#sec-4-3">4.3. Skeletons, outline and abbrevs</a></li>
<li><a href="#sec-4-4">4.4. Miscellaneous</a></li>
<li><a href="#sec-4-5">4.5. ANSYS syntax restrictions not (yet) accounted for</a></li>
<li><a href="#sec-4-6">4.6. Unknown ANSYS stuff</a></li>
<li><a href="#sec-4-7">4.7. Additional APDL macro resources</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Deficiencies:</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt> Highlighting </dt><dd>Experimental user variable highlighting
does not take into account:
<ul class="org-ul">
<li>clearing of variables and
</li>
<li>usage of variables before their definitions (uninitialised
variables)
</li>
<li>the variable fontification might clash with ANSYS specifiers
</li>
<li>string substitution of %variables% in strings does not highlight
them in the proper variable face
</li>
</ul>
</dd>
<dt> Highlighting </dt><dd>A label :LABEL may appear behind the /input
command and is not highlighted as label
</dd>
<dt> Highlighting </dt><dd>An apostrophy clashes with the ANSYS "char"
specifier Keybinding: M-Tab is captured under
Windows and some GNU-Linux desktops Workaround: Press
instead of M-Tab (ALT + TAB) the ESC key and then
the Tab key (ESC, TAB) or apply the command from
the menu bar
</dd>
<dt> Highlighting </dt><dd>The parameter help overlay is only removed after 2
min if the respective ANSYS-Mode buffer is the
current buffer at that time span!
</dd>
<dt> Keybinding </dt><dd>M-j: When there is already a `&amp;' in a format command
(like *msg, *vwrite, *mwrite)
ansys-indent-format-line inserts a redundant one
</dd>
<dt> Completion </dt><dd>Of parametric function parentheses
completes redundant closing parentheses
</dd>
<dt> Completion </dt><dd>A mouse selection from the <b>ANSYS-completion</b> buffer
is only inserted upcased.
</dd>
<dt> Completion </dt><dd>ANSYS command 'C***' will not be completed
</dd>
<dt> Skeleton </dt><dd>Mouse selection of -structural-template does not work
(because of stipulated user text input from this skeleton)
</dd>
<dt> Navigation </dt><dd>C-c { does not skip an overlay in a number-block
(M-{ does it though))
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 16.1.2:</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Bugs</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Mouse completion is working with middle mouse button but only
on the second LMB or, in the case of C-c C-s, not at all.
</li>
<li>*mwrite
*cfclos
M-? shows help for *mwrite, when cursor behind *cfclos and in the
last line without \n
</li>
<li>C-c C-a does not align a pragraph if the mark was not set (first
time file visit)!!!!!
</li>
<li>path construction in -mode.el for help program is not working, if
ansys-mode is not activated!? &lt;- autoloaded functions, should
work they are calling -mode.el!
</li>
</ul>
</div>
</div>
