TODO.org
** Wish-list
   - color scheme of *msg command is only readable on terminals
   - add adwords to gh-pages
   - abreviated input method for all graphics functions zoom, etc.
   - defaults for template MP
   - Add WorkBench (Aim) concepts to APDL translation in A-M_APDL_reference
   - -show-command-parameters is not dynamically updated in the first line
   - Correct the creep data together with young's modulus and total
     strain to creep strain!
   - add bbdb files to emacs packages?
   - variables behind / and * without whitespace in between are not
     highlighted! try changing the character syntax???
   - C-c C-a does not take signs (e.g. +13, -8) befor numbers into account
   - implement -hide-region also for rotated nodes in WB .dat files
     (frictionless support)
   - Targeting AnsysClassics (-send-to-ansys) AND ANSYS Aim
   - show defaults for -license-file, license-utility and -ansysli-servers
   - *msg command's format string is not higlighted (-template-element-table)
   - Variables are not highlighted in -skeletons, it is specified in
     -mode only for files with .mac suffix; *create file tmp,mac:
     macro call: tmp, is not highlighted
   - started and commented out highlighting of solver output
   - makefile errors when doing -fontification.el?
   - ansys-template.el:85:13:Warning: reference to free variable
     `ansys-skeleton-overlay'
   - mouse-choose-completion is obsolete since E23.2
   - example of an ansyslmd.ini?
   - add timer customisation for -command-parameter-help variable 1
     min, 2 min, etc.
   - example.mac: make it solver compatible
   - check *vwrite with gui mode and interactive mode (graphics window?)
   - add element numbers to the general completion list, yes or no?
   - WikEmacs, Melpa, GNU ELPA and/or marmalade, ANSYS-Mode debian
     .deb package
   - HTML APDL documentation
     here is the tanslation of names to html files:
     - link to ANSYS-Mode APDL reference:
     - Chapters of structural APDL documentation:
   - TODOS: in fontification.org
     - deletion of vectors *del,Vector without request? ,,nopr?
     - check character variables 32 Chars. and highlight accordingly
       string 128, char 8
     - *vscfun: mean, stdev, ...
   - -dynamic-highlighting is sluggish, highlighting somehow
     retarded!!! Still??
   - _RETURN (-mode) somewhat milder red, clashes with reseved vars!
   - test server specifications (menu!) make interconnect
     conditional of the ANSYS version >= 120
   - explain fill/*vfill under the "looping" commands: Generates a line
       of nodes between two existing nodes.
   - switch automatically to read only mode for *.dat files?
   - force harmonic table (*vfill) example in -skeleton-bc, make a
       ansys...-template out of two-mass-harmonics.mac
   - -program, -license-file and -ansysli-servers should show the
     current selections
   - check -license-file var with -license-file-check
     - Emacs var  :DONE:
     - env vars  :DONE:
     - activate -license-file function :TODO:
   - document Lagrange contact behaviour for contact/press-fit
     skeleton, critical to element differences!
   - constraint equations in -template.el and get functions
   - fontification.el
     - add the 4 ANSYS neutral file (aux15) functions to the parameter-help,
       .anf files from DM anf export
         kpt -- Write keypoints or vertices into the database
         lcurv -- Write lines or edges into the database
         asurf -- Write the area or face information into the database
         vbody -- Define a B-rep solid.
     - add Hlp_G_OPE6_NeutralFile.html (aux15 utility functions)
       commands to the fontification and help stuff: KPT, LCURV,
       ASURF, VBODY. (functions in ANF files) from the operations
       guide `ans_ope.pdf'
     - some functions in -skeleton-function are not highlighted and
       completable, whitespace problem befor paren...
       and: "nele" undocumented command and function nelem()
   - inconsistencies in A-M_introductory_tutorial.org
     - the parameter help overlay is dated
     - in variable.png symbols Ns and Ls are not highlighted as
       variables
     - change sequence of alignment.png first not aligned, second aligned
     - Too difficult: slide of extensibility, showing Emacs
       self-documenting help system for a template function
* Procedures
  - GNU-Linux :: ;-)
  - Mode Help :: keyboard input is quoted in "", emphasizing in `' and
                 keys in <>
  - APDL templates :: minimal working examples ending with -template
  - Menu :: -> indicates the following sub menu entry ->
  - M-x compile :: ALL ;-)

   GH-wiki is repo with write access for world, separate from the A-M repo!

** Freeze proceedures
  - check whether all undocumented commands
    [[elisp:(find-tag "Ansys_undocumented_commands")]]
    are still working in V 16.2
  - (tags-search "TODO")
  - (tags-search "FIXME")
  - checkdoc, -template.el, -process.el, -mode.el done except
    \\<keymap> & \\[function]
  - README -- installation (Emacs Wiki format) and accompanying files,
       features, news, history
  - update the mode help, update version numbers, default specifiers
  - update defcustom list in ./bug-report.sh -> ansys-submit-bug-report
  - update/complete skeletons menu

    # ansys
    (tags-query-replace "16.1" "16.2")
    (tags-query-replace "ANSYS 16" "ANSYS 17")
    # emacs
    (tags-query-replace "24.5" "24.6")
    # version No
    (tags-query-replace "161" "170")
    # for _mode_version
    (tags-query-replace "\".1\"" "\".2\"")
    # copyright
    (tags-query-replace "- 2015" "- 2016")
    (tags-query-replace "fontification.mac" "example.mac")

    checkdoc then dry run: Emacs
    24.5 -Q testing: example.mac /*commands and default command
    lines, every menu entry.  byte-compile-file then dry run
    profiling, major mode conventions: multiple loading of this mode?.
  - check Emacs versions on longterm OS systems compile with 24.X,
    then pretests, emacs-snapshots, clash with Emacs releases (yearly
    Emacs cycle)?

