TODO.html
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Wish-list</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>add adwords to gh-pages
</li>
<li>abreviated input method for all graphics functions zoom, etc.
</li>
<li>defaults for template MP
</li>
<li>Add WorkBench (Aim) concepts to APDL translation in A-M<sub>APDL</sub><sub>reference</sub>
</li>
<li>-show-command-parameters is not dynamically updated in the first line
</li>
<li>Correct the creep data together with young's modulus and total
strain to creep strain!
</li>
<li>add bbdb files to emacs packages?
</li>
<li>variables behind / and * without whitespace in between are not
highlighted! try changing the character syntax???
</li>
<li>C-c C-a does not take signs (e.g. +13, -8) befor numbers into account
</li>
<li>implement -hide-region also for rotated nodes in WB .dat files
(frictionless support)
</li>
<li>Targeting AnsysClassics (-send-to-ansys) AND ANSYS Aim
</li>
<li>show defaults for -license-file, license-utility and -ansysli-servers
</li>
<li>*msg command's format string is not higlighted (-template-element-table)
</li>
<li>Variables are not highlighted in -skeletons, it is specified in
-mode only for files with .mac suffix; *create file tmp,mac:
macro call: tmp, is not highlighted
</li>
<li>started and commented out highlighting of solver output
</li>
<li>makefile errors when doing -fontification.el?
</li>
<li>ansys-template.el:85:13:Warning: reference to free variable
`ansys-skeleton-overlay'
</li>
<li>mouse-choose-completion is obsolete since E23.2
</li>
<li>example of an ansyslmd.ini?
</li>
<li>add timer customisation for -command-parameter-help variable 1
min, 2 min, etc.
</li>
<li>example.mac: make it solver compatible
</li>
<li>check *vwrite with gui mode and interactive mode (graphics window?)
</li>
<li>add element numbers to the general completion list, yes or no?
</li>
<li>WikEmacs, Melpa, GNU ELPA and/or marmalade, ANSYS-Mode debian
.deb package
</li>
<li>HTML APDL documentation
here is the tanslation of names to html files:
<ul class="org-ul">
<li>link to ANSYS-Mode APDL reference:
</li>
<li>Chapters of structural APDL documentation:
</li>
</ul>
</li>
<li>TODOS: in fontification.org
<ul class="org-ul">
<li>deletion of vectors *del,Vector without request? ,,nopr?
</li>
<li>check character variables 32 Chars. and highlight accordingly
string 128, char 8
</li>
<li>*vscfun: mean, stdev, &#x2026;
</li>
</ul>
</li>
<li>-dynamic-highlighting is sluggish, highlighting somehow
retarded!!! Still??
</li>
<li>_RETURN (-mode) somewhat milder red, clashes with reseved vars!
</li>
<li>test server specifications (menu!) make interconnect
conditional of the ANSYS version &gt;= 120
</li>
<li>explain fill/*vfill under the "looping" commands: Generates a line
of nodes between two existing nodes.
</li>
<li>switch automatically to read only mode for *.dat files?
</li>
<li>force harmonic table (*vfill) example in -skeleton-bc, make a
ansys&#x2026;-template out of two-mass-harmonics.mac
</li>
<li>-program, -license-file and -ansysli-servers should show the
current selections
</li>
<li>check -license-file var with -license-file-check
<ul class="org-ul">
<li>Emacs var  :DONE:
</li>
<li>env vars  :DONE:
</li>
<li>activate -license-file function :TODO:
</li>
</ul>
</li>
<li>document Lagrange contact behaviour for contact/press-fit
skeleton, critical to element differences!
</li>
<li>constraint equations in -template.el and get functions
</li>
<li>fontification.el
<ul class="org-ul">
<li>add the 4 ANSYS neutral file (aux15) functions to the parameter-help,
.anf files from DM anf export
  kpt &#x2013; Write keypoints or vertices into the database
  lcurv &#x2013; Write lines or edges into the database
  asurf &#x2013; Write the area or face information into the database
  vbody &#x2013; Define a B-rep solid.
</li>
<li>add Hlp<sub>G</sub><sub>OPE6</sub><sub>NeutralFile</sub>.html (aux15 utility functions)
commands to the fontification and help stuff: KPT, LCURV,
ASURF, VBODY. (functions in ANF files) from the operations
guide `ans<sub>ope</sub>.pdf'
</li>
<li>some functions in -skeleton-function are not highlighted and
completable, whitespace problem befor paren&#x2026;
and: "nele" undocumented command and function nelem()
</li>
</ul>
</li>
<li>inconsistencies in A-M<sub>introductory</sub><sub>tutorial</sub>.org
<ul class="org-ul">
<li>the parameter help overlay is dated
</li>
<li>in variable.png symbols Ns and Ls are not highlighted as
variables
</li>
<li>change sequence of alignment.png first not aligned, second aligned
</li>
<li>Too difficult: slide of extensibility, showing Emacs
self-documenting help system for a template function
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Procedures</h2>
<div class="outline-text-2" id="text-3">
<dl class="org-dl">
<dt> GNU-Linux </dt><dd>;-)
</dd>
<dt> Mode Help </dt><dd>keyboard input is quoted in "", emphasizing in `' and
keys in &lt;&gt;
</dd>
<dt> APDL templates </dt><dd>minimal working examples ending with -template
</dd>
<dt> Menu </dt><dd>-&gt; indicates the following sub menu entry -&gt;
</dd>
<dt> M-x compile </dt><dd>ALL ;-)

<p>
GH-wiki is repo with write access for world, separate from the A-M repo!
</p>
</dd>
</dl>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Freeze proceedures</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>check whether all undocumented commands
<a href="(find-tag "Ansys_undocumented_commands")">(find-tag "Ansys_undocumented_commands")</a>
are still working in V 16.2
</li>
<li>(tags-search "TODO")
</li>
<li>(tags-search "FIXME")
</li>
<li>checkdoc, -template.el, -process.el, -mode.el done except
\\&lt;keymap&gt; &amp; \\[function]
</li>
<li>README &#x2013; installation (Emacs Wiki format) and accompanying files,
features, news, history
</li>
<li>update the mode help, update version numbers, default specifiers
</li>
<li>update defcustom list in ./bug-report.sh -&gt; ansys-submit-bug-report
</li>
<li>update/complete skeletons menu

<p>
(tags-query-replace "16.1" "16.2")
(tags-query-replace "ANSYS 16" "ANSYS 17")
</p>
<p>
(tags-query-replace "24.5" "24.6")
</p>
<p>
(tags-query-replace "161" "170")
</p>
<p>
(tags-query-replace "\".1\"" "\".2\"")
</p>
<p>
(tags-query-replace "- 2015" "- 2016")
(tags-query-replace "fontification.mac" "example.mac")
</p>

<p>
checkdoc then dry run: Emacs
24.5 -Q testing: example.mac /*commands and default command
lines, every menu entry.  byte-compile-file then dry run
profiling, major mode conventions: multiple loading of this mode?.
</p>
</li>
<li>check Emacs versions on longterm OS systems compile with 24.X,
then pretests, emacs-snapshots, clash with Emacs releases (yearly
Emacs cycle)?
</li>
</ul>
</div>
</div>
