TODO.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Release</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Add the latest news from NEWS.org to the README.org
</li>
<li>update Emacs wiki (README), home page, GitHub, Google drive with
download, documentation page
</li>
<li>publication emails (with tutorial and news):

<p>
The project is hosted on
</p>

<p>
<a href="https://github.com/dieter-wilhelm/ansys-mode">https://github.com/dieter-wilhelm/ansys-mode</a>
</p>

<p>
Where you will find the latest development version.
</p>

<p>
Stable versions and prebuild packages are on the releases page:
</p>

<p>
<a href="https://github.com/dieter-wilhelm/ansys-mode/releases">https://github.com/dieter-wilhelm/ansys-mode/releases</a>
</p>

<p>
An alternative releases archive is hosted at Google Drive:
</p>

<p>
<a href="https://drive.google.com/?tab=mo&authuser=0#folders/0Bxnk08BGWfexUThqbWxLX1NyeTg">https://drive.google.com/?tab=mo&authuser=0#folders/0Bxnk08BGWfexUThqbWxLX1NyeTg</a>
</p>

<p>
If you don't have access to above archives please email me.
</p>

<p>
Dieter
</p>
</li>
</ul>


<p>
makgul@gmail.com,
yangdawei.hit@qq.com
weizhuo.du@peraglobal.com,
info@auc-ev.de,
afoleite@gmail.com,
iivvgg@gmail.com,
Michaelk@vipac.com.au,
sparr@mfkrs1.mw.tu-dresden.de,
eyk.heinemann@continental-corporation.com,
jens.2.missun@continental-corporation.com,
joerg.menke@continental-corporation.com,
marius.tarnovetchi@continental-corporation.com,
razvan.ionel.curtean@continental-corporation.com,
Steffen.Kernbach@continental-corporation.com,
Johann.Massinger@continental-corporation.com,
Marco.Mechi@continental-corporation.com,
Antonio.Zangaro@continental-corporation.com,
martin.bruehl@continental-corporation.com,
zlatko.penzar@continental-corporation.com,
saravana.kumar@continental-corporation.com,
alwin.perras@continental-corporation.com,
mhanke@cadfem.de,
tnelson@cadfem.de,
lkrueger@cadfem.de,
sheldonimaoka@yahoo.com,
kschoenborn@cadfem.de
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Ideas for further versions</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Parameter help and documentation</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Enable a mouse button to unhide hidden regions, enable an
interactive way to unhide regions, when in the region: Return
opens hidden region, &#x2026;
</li>
<li>dynamic completion and help of parameter options, depending on
the contex like the one in bash
</li>
<li>makeinfo documentation with org-mode ox exporter
</li>
<li>make completion of templates with &lt;mouse 1&gt; button additionally
to &lt;mouse 2&gt; as in -complete-symbol.
</li>
<li>create a function showing deprecated elements and their
replacement.  Inspirations from eldoc-mode, show replacements of
deprecated elements?
</li>
<li>create a reference card
</li>
<li>show list of license products and their license feature names or
translate it in the license status from the licensing guide
(product variable table)
</li>
<li>C-c C-v show (optionally) only variables defined up to current
cursor line.  Make the line number display in
`ansys-display-variables' (hyper-)links to the corresponding code
line in the respective APDL file.  (See `occur' function.)  Or
use the imenu mechanism for this and display the variables in the
speedbar. Count the number of user variables when displaying them
</li>
<li>refcard, etc; Emacs help guidelines
GNU programming guideline: More requires?,
</li>
<li>display alternatives to/swap deprecated element types
</li>
<li>M-? Help: parametric functions are not explained with the help
command
</li>
<li>M-? Help: if there are ignored characters behind the keyword, the
keyword is not found
</li>
<li>M-? the command help does not work when there are solver ignored
characters behind the unique command name, example: *VWROOOOM.
</li>
<li>M-?: following a variable allocation with `='
</li>
<li>M-?: In the last empty line displays overlay below command
instead above
</li>
<li>Provide ANSYS command completion and command-help in comint
buffer
</li>
<li>Include all inquiry functions (see UPF documentation)
</li>
<li>Include the _RETURN value of the solid modelling commands into
their help strings of parameter help.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> ANSYS process and interpreter buffer</h3>
<div class="outline-text-3" id="text-4-2">
<p>
example: gnuplot-mode
</p>
<ul class="org-ul">
<li>call to start the ANSYS solution results tracker for .nlh (xml
see <a href="file.nlh">file.nlh</a>, contact forces) and convergence .gst (binary?,
coded? <a href="file.gst">file.gst</a>)
</li>
<li>implement something like <a href="nlhist.sh">nlhist.sh</a> for .cnd files (xml see
<a href="file.cnd">file.cnd</a>) or use the new libxml parser ;-)
</li>
<li>make display-buffer "<b>ANSYS</b>" optional when sending commands to
the ANSYS process
</li>
<li>use ANSYS <b>env variables</b> like AWP<sub>ROOT140</sub> for checking
installation directories
</li>
<li>check also the license status for hpc licenses if
-no-of-processors is greater then 3
</li>
<li>implement ANSWAIT variable
</li>
<li>autoloading of: -license-file, -license-program functions
</li>
<li>dbus support of workbench or integrating emacs in workbench?
</li>
<li>insert skeleton with C-c C-s i, send line C-c C-c ccc
</li>
<li>warn when C-c C-c tries to send a block command (complete to full
block?)
</li>
<li>take care when region isn't complete in -send-to-ansys (send whole line)
</li>
<li>C-c C-c skips empty lines and comments this is not always desirable
-&gt; make this optional -&gt; filter process input?
</li>
<li>C-c C-q, C-c C-u and C-c C-c sequences are not shown (and stored)
in the comint buffer
</li>
<li>make filter of -license-status optional
</li>
<li>optimise -start-run with query of y (start immediately),n
(exit),e (change params),C-h (help)
</li>
<li>Splice any input line behind the BEGIN: symbol in the <b>ANSYS</b>
     buffer
</li>
<li>Enable one solver run for every ANSYS macro buffer
</li>
<li>indicate with activation/inactivation of menu items that an
asynchronous job is already running or not.
</li>
<li>show/mark sent lines in apdl file C-c C-u, C-c C-c,
<ul class="org-ul">
<li>with fringes
</li>
<li>with background
</li>
<li>maximum line
</li>
<li>reset highlighting, when?
</li>
</ul>
</li>
<li>provide ANSYS `y' request and carriage return? superflouous?  a
single `y' does the trick
</li>
<li>Killing a buffer with a running process now asks a confirmation.
You can remove this query in two ways: either removing
`process-kill-buffer-query-function' from
`kill-buffer-query-functions' or setting the appropriate process
flag with `set-process-query-on-exit-flag'.
<ul class="org-ul">
<li>finding an ANSYS /filnam command in current macro file and
suggesting this as current job-name optionally kill old job when
called again with working run warn and optionally remove the
ansys lock file before starting a run
</li>
<li>search in -job for /filn arguments as default job name like in
-display-error-file
</li>
</ul>
</li>
</ul>
</div>
</div>
