TODO.html
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Skeletons, outline and abbrevs</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>show a preview buffer with the outline headlines
</li>
<li>-skeleton-select is a bit thin, not yet finished?
</li>
<li>add a preview mode, with its own keymap for faster editing and
copying, like dired
</li>
<li>enhance abbrev definitions for *create, *dowhile logics:
</li>
<li>use the ANSYS sample input listing for template-examples
</li>
<li>additional dialog boxes with:
/ui,anno,ksel&#x2026;,wpse,help,query,copy
</li>
<li>make outline string in skeletons configurable
</li>
<li>spider beams, _bolt.mac, screw.mac, Mohr-Coulomb criterion
</li>
<li>rework concept with respect to the ANSYS menu structure sort
skeletons in menu. Concept: 1.) ANSYS Workflow 2.) specialised
macro library
</li>
<li>Make skeleton-header properly working (info "(autotype)")
</li>
<li>Optimise templates: completing-read, read-from-minibuffer
</li>
<li>abbrev `d does not indent properly in another block level
</li>
<li>Implement choice when completing *IF commands (*ELSEIF or *ENDIF
?THEN?).
</li>
<li>Warn when including skeleton in read only file.
</li>
<li>skeleton for numbering ansys-skeleton-numbering-controls
(skeleton-insert docu)
</li>
<li>suggestions with auto-completion of
kp,line,area,volu,node,elem,tabn,sval
</li>
<li>negation, what negation? TODO:
</li>
<li>skeleton for skipping code *if,then *else*endif if selection:
wrap around and indenting *go/*if label is not fontified at the
command line (restriction of 7 characters with out the colon.)
must *go:label be unambiguous?
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Miscellaneous</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>hash or signature file for packages
</li>
<li>show content of matlib/ folder
</li>
<li>add to -display-variables a prefix argument for showing the value
of the variable around point, or center the variables window&#x2026;
</li>
<li>customisation option for a the web browser of -browse-ansys-help
</li>
<li>ideas for preview also of a/the macro directory?
</li>
<li>put graphics dlls in windows package
</li>
<li>LSDYN support, see lsdyna.el
</li>
<li id="embedded calc">include in hacking.mac
</li>
<li id="Alignment">alignment "section" is not clearly defined in function
-align
</li>
<li id="alignment">extend to vector definitions
t(1,0) = 20,300,3094,
t(1,1) =  3,  4,   9,
</li>
<li>Utility for clearing files like .rst, &#x2026; or using dired, clear<sub>files</sub>.sh?
with listing listing of file types
</li>
<li>Configure the highlighting colours with black on white background
</li>
<li>C-j, M-j are not skipping to `,' whith default command (from second
line onwards)!
</li>
<li>supply command for clearing recursively not important process files:
.rst, .log, &#x2026;, supply a customisaton variable
</li>
<li>narrow, outline, transparent-font: eblocks, nblocks by default?
</li>
<li>add notes for parameter help of undocumented commands (alist)
</li>
<li>create filter variable for hiding not installed license types
("aiiges" "aihexa") or better regexp filter "ai.*\\|acf.*"
</li>
<li>commands shorter than 4 chars are not allowed with additional chars
adjust this to -highlighting-level 0
</li>
<li>Make ANSYS-Mode also working solely with ansys-mode.el??
</li>
<li>make M-C-h more intelligent like M-h (if mark&#x2026;)
</li>
<li>speed concern: replace -find-duplicate-p with function argument to
add-to-list
</li>
<li>For non-comint-mode usage: display .log file with tail mode
</li>
<li>is outline-mode enabled? no! make default?, outline
</li>
<li>take care of setup procedure: v110/ansys/apdl/start110.ans
/MPLIB,READ,/ansys<sub>inc</sub>/v110/ansys/matlib
</li>
<li>removing/renaming/checking abort file?
</li>
<li>Are characters behind unique commands shorter than 4 characters
possible? No /sol(u) sufficient? Yes condensed input line ($)
behind commands without arguments possible? Yes have a look in
-variable-defining-commands!  Warn when - unintentionally -
arguments are used for ANSYS commands which do not allow
arguments.  Or implement some auto-newline feature?  But
problematic in condensed command lines or when applying code
comments!
</li>
<li>undocumented ask parameter
</li>
<li>mode-line-format nil);no mode line for this buffer Unambiguous
</li>
<li>Emacs: old-style backquotes?  used in the old template macro system
</li>
<li>completion of function names: cursor should end within parentheses
</li>
<li>better hints for auto-insertion features
</li>
<li>up/down-block when we are over a begin-keyword and in a block-end
line
</li>
<li>component names are fontified as variables! separate them cmlist?
</li>
<li>format string for *VWRITE: line(s) below, in parens, when FORTRAN
format specifiers are used, keyword SEQU povides row numbers, up
to 19 parameters are allowed
</li>
<li>remove vestiges of ansys-mod.el for making ansys-mode.el GPL
proof.  Check whether octave-mod.el really is GPL compliant, use
-ctave-mod.el from 1997, kill octave-mod.el afterwards in
makefile read every symbol docu string -&gt;NEW<sub>C</sub> or _C or OCTAVE<sub>C</sub>
</li>
<li>replace/extend column-ruler with ruler-mode or ruler implemented as
overlay in buffer
</li>
<li>make everything completely customisable, eg auto-insert stuff
customisable enable, Emacs customisation of auto-insert-query
</li>
<li>Fontify <b>completion list</b> distinguishing elements: commands,
functions and keywords.
</li>
<li>provide a list of options for the -license function, set this
function in the defcustom lmstat -a etc.
</li>
<li>auto-indent-switch as defcustom?
</li>
<li>inhibit the unnecessary blink-matching-block display when closing a
block behind a block-end keyword
</li>
<li>highlight matching block keywords (similar to show-paren-mode) when
point is at keyword
</li>
<li>Implement highlighting of bracket pairs with the correct level in
ANSYS GET- and parametric- functions.
</li>
<li>highlighting of plot commands inside the /GCMD command
</li>
<li>DEFSUBSTs with DEFUNs inside aren't particularly helpful?
</li>
<li>Emphasise better implied (colon) loops n,(1:6),(2:12:2) =&gt; n,1,2
$ n,2,4 $&#x2026; (little used, I know, but any ideas going beyond the
colon?).
</li>
<li>startup screen for ANSYS mode: Mode help, ANSYS version,
supressing the startup screen 'ansys-mode-startup-message maybe
as advice when sluggish -&gt; compiliation
</li>
<li>Enable choice for /show,3d or x11 (-start-graphics)
</li>
<li>Provide a way to send commands to the tcl-tk ANSYS gui (x11
programming).
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> ANSYS syntax restrictions not (yet) accounted for</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>Parentheses can only be nested 4 levels deep and only up to 9
operations (+,-,*,&#x2026;) within these set of parentheses
</li>
<li>PATH name is restricted to 8 chars
</li>
<li>*SET parameter strings may only be 32 character long!
</li>
<li>Character parameters are restricted to only 8 characters.
</li>
<li>*MSG command can only have 9 additional continuation lines
</li>
<li>Code line restriction of 640 characters
</li>
<li>Block level restriction of 20 levels of nested *DO loops (except
with /INPUT and *USE)
</li>
<li>Block level restriction of 10 levels of nested *IF blocks
</li>
<li>Macro level restriction: 20 macros
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Unknown ANSYS stuff</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>what the heck is the *UILIST command?
</li>
<li>Is hyper56 a valid element?
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> Additional APDL macro resources</h3>
<div class="outline-text-3" id="text-4-7">
<p>
see <a href="http://www.apdl.de">http://www.apdl.de</a> for further ideas and extensions or
  <a href="http://www.padtinc.com/">http://www.padtinc.com/</a>.
</p>
<hr  />
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: H. Dieter Wilhelm (<a href="mailto:dieter@urmel">dieter@urmel</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
